interface LineColorType {
  [key: string]: string;
}

export const line_color: LineColorType = {
  '1호선': '#0d347f',
  '2호선': '#3b9f37',
  '3호선': '#EE7A30',
  '4호선': '#4E9DD9',
  '5호선': '#7E43D8',
  '6호선': '#A95523',
  '7호선': '#6B7128',
  '8호선': '#D3396E',
  '9호선': '#C8A44E',
  경의중앙선: '#A1BACE',
  서해선: '#96D457',
  수인분당선: '#F8CE55',
  신분당선: '#C95450',
  인천선: '#0080ff',
  인천2호선: '#F5A251',
  우이신설선: '#B3C73E',
  경춘선: '#5DA9AE',
  경강선: '#376EC7',
  공항철도: '#7DB3E3',
  에버라인: '#95C569',
  신림선: '#6E88C5',
  ITX: '#52AB57',
  의정부경전철: '#E0A243',
  김포골드: '#B69745',
};
